// func_4_9.cpp : 此文件包含 "main" 函数。程序执行将在此处开始并结束。

/*给定一个非负的整数 n，计算从 0 到 10n 之间有
多少个整数是由不同的数字组合成的。例如输入2，
统计 0<=x<102 之间有多少个整数是由不同的数字组合成时，
应去掉带有重复数字的整数 11、22、33、44、55、66、77、88、99，
最后返回结果为 91。注意：测试数据有多组输入*/

#include <iostream>
using namespace std;
int sum(int);
int main()
{
    int n = 0;
    while (cin >> n)
    {
        cout << sum(n) << endl;
    }
}
int sum(int m)
{
    int summ = 1;
    if (m == 1)
    {
        return 10;
    }
    else if(m <= 10)
    {
        for (int i = 10;i > (10-m);i--)
        {
            summ *= i;
        }
        summ = (summ / 10) * 9;
        summ += sum(m - 1);
        return summ;
    }
    else
    {
        return 0;
    }
}

// 运行程序: Ctrl + F5 或调试 >“开始执行(不调试)”菜单
// 调试程序: F5 或调试 >“开始调试”菜单

// 入门使用技巧: 
//   1. 使用解决方案资源管理器窗口添加/管理文件
//   2. 使用团队资源管理器窗口连接到源代码管理
//   3. 使用输出窗口查看生成输出和其他消息
//   4. 使用错误列表窗口查看错误
//   5. 转到“项目”>“添加新项”以创建新的代码文件，或转到“项目”>“添加现有项”以将现有代码文件添加到项目
//   6. 将来，若要再次打开此项目，请转到“文件”>“打开”>“项目”并选择 .sln 文件
