// func_4_6.cpp : 此文件包含 "main" 函数。程序执行将在此处开始并结束。
//
/*假设现在你拥有一支股票一周的价格序列，第i天的股票价格位于序列的第i个位置，
现在你只允许做一次交易,也就是说只能先买入再卖出股票（卖出的时间要晚于买入的时间）。
请设计程序找出最佳交易时机使得获利最大化。输出最大的获利结果。如果没有可能获利，输出0。*/
#include <iostream>
using namespace std;
int main()
{
    int t;
    cin >> t;
    for (int k = 0;k < t;k++)
    {
        int prize[7] = { 0 };
        int feedback = 0;
        for (int i = 0;i < 7;i++)
        {
            cin >> prize[i];
        }
        for (int i = 0;i < 6;i++)
        {
            for (int j = i + 1;j < 7;j++)
            {
                if ((prize[j] - prize[i]) > feedback)
                {
                    feedback = prize[j] - prize[i];
                }
            }
        }
        cout << feedback << endl;
    }
    return 0;
}

// 运行程序: Ctrl + F5 或调试 >“开始执行(不调试)”菜单
// 调试程序: F5 或调试 >“开始调试”菜单

// 入门使用技巧: 
//   1. 使用解决方案资源管理器窗口添加/管理文件
//   2. 使用团队资源管理器窗口连接到源代码管理
//   3. 使用输出窗口查看生成输出和其他消息
//   4. 使用错误列表窗口查看错误
//   5. 转到“项目”>“添加新项”以创建新的代码文件，或转到“项目”>“添加现有项”以将现有代码文件添加到项目
//   6. 将来，若要再次打开此项目，请转到“文件”>“打开”>“项目”并选择 .sln 文件
